
#### Terraform Format and Style 🖌: success
#### Terraform Initialization ⚙️: success
#### Terraform Validation 🤖: Success! The configuration is valid.


#### Terraform Plan 📖: success
<details><summary>Show Plan</summary>

```
terraform
module.git.github_repository.devops_challenge: Refreshing state... [id=devops-challenge-teamsoft]
module.git.github_branch_protection.devops_challenge: Refreshing state... [id=BPR_kwDONzQI9c4DiCKo]
module.s3.aws_s3_bucket.server_terraform_bucket: Refreshing state... [id=devops-challenge-teamsoft-terraform-bucket]
module.s3.aws_s3_bucket.server_ssh_keys_bucket: Refreshing state... [id=devops-challenge-teamsoft-ssh-keys-bucket]
module.git.github_actions_secret.devops_challenge_git_auth_token: Refreshing state... [id=devops-challenge-teamsoft:GIT_AUTH_TOKEN]
module.git.github_actions_secret.devops_challenge_aws_access_key_id: Refreshing state... [id=devops-challenge-teamsoft:AWS_ACCESS_KEY_ID]
module.git.github_actions_secret.devops_challenge_runner_github_token: Refreshing state... [id=devops-challenge-teamsoft:RUNNER_GITHUB_TOKEN]
module.git.github_actions_secret.devops_challenge_aws_secret_access_key: Refreshing state... [id=devops-challenge-teamsoft:AWS_SECRET_ACCESS_KEY]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.git.github_actions_secret.devops_challenge_aws_access_key_id has been deleted
  - resource "github_actions_secret" "devops_challenge_aws_access_key_id" {
      - created_at      = "2025-02-02 18:10:04 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "devops-challenge-teamsoft:AWS_ACCESS_KEY_ID" -> null
      - plaintext_value = (sensitive value)
      - repository      = "devops-challenge-teamsoft" -> null
      - secret_name     = "AWS_ACCESS_KEY_ID" -> null
      - updated_at      = "2025-02-02 22:22:43 +0000 UTC" -> null
    }

  # module.git.github_actions_secret.devops_challenge_aws_secret_access_key has been deleted
  - resource "github_actions_secret" "devops_challenge_aws_secret_access_key" {
      - created_at      = "2025-02-02 18:10:05 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "devops-challenge-teamsoft:AWS_SECRET_ACCESS_KEY" -> null
      - plaintext_value = (sensitive value)
      - repository      = "devops-challenge-teamsoft" -> null
      - secret_name     = "AWS_SECRET_ACCESS_KEY" -> null
      - updated_at      = "2025-02-02 22:22:42 +0000 UTC" -> null
    }

  # module.git.github_actions_secret.devops_challenge_git_auth_token has been deleted
  - resource "github_actions_secret" "devops_challenge_git_auth_token" {
      - created_at      = "2025-02-02 22:14:56 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "devops-challenge-teamsoft:GIT_AUTH_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "devops-challenge-teamsoft" -> null
      - secret_name     = "GIT_AUTH_TOKEN" -> null
      - updated_at      = "2025-02-02 22:37:32 +0000 UTC" -> null
    }

  # module.git.github_actions_secret.devops_challenge_runner_github_token has been deleted
  - resource "github_actions_secret" "devops_challenge_runner_github_token" {
      - created_at      = "2025-02-02 22:37:34 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "devops-challenge-teamsoft:RUNNER_GITHUB_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "devops-challenge-teamsoft" -> null
      - secret_name     = "RUNNER_GITHUB_TOKEN" -> null
      - updated_at      = "2025-02-02 22:37:34 +0000 UTC" -> null
    }

  # module.git.github_branch_protection.devops_challenge has been deleted
  - resource "github_branch_protection" "devops_challenge" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - enforce_admins                  = false -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDONzQI9c4DiCKo" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - repository_id                   = "devops-challenge-teamsoft" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = false -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 0 -> null
          - restrict_dismissals             = false -> null
        }
    }

  # module.git.github_repository.devops_challenge has changed
  ~ resource "github_repository" "devops_challenge" {
      ~ delete_branch_on_merge      = true -> false
      ~ etag                        = "W/\"c30ebe43146c4bed8f762443e89835cec574d5d2b5429b45a2c3ac4eca9e0807\"" -> "W/\"402b2be76d9669ce21233e841b5450d603c92c2fbaf8c0d2c24f72cbf0a93688\""
      ~ has_downloads               = false -> true
      ~ has_issues                  = false -> true
      ~ has_projects                = false -> true
      ~ has_wiki                    = false -> true
        id                          = "devops-challenge-teamsoft"
        name                        = "devops-challenge-teamsoft"
      ~ node_id                     = "R_kgDONzQI9Q" -> "R_kgDONzXdBg"
      - primary_language            = "HCL" -> null
      ~ repo_id                     = 926157045 -> 926276870
        # (25 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.git.github_actions_secret.devops_challenge_aws_access_key_id will be created
  + resource "github_actions_secret" "devops_challenge_aws_access_key_id" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-challenge-teamsoft"
      + secret_name     = "AWS_ACCESS_KEY_ID"
      + updated_at      = (known after apply)
    }

  # module.git.github_actions_secret.devops_challenge_aws_secret_access_key will be created
  + resource "github_actions_secret" "devops_challenge_aws_secret_access_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-challenge-teamsoft"
      + secret_name     = "AWS_SECRET_ACCESS_KEY"
      + updated_at      = (known after apply)
    }

  # module.git.github_actions_secret.devops_challenge_git_auth_token will be created
  + resource "github_actions_secret" "devops_challenge_git_auth_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-challenge-teamsoft"
      + secret_name     = "GIT_AUTH_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.git.github_actions_secret.devops_challenge_runner_github_token will be created
  + resource "github_actions_secret" "devops_challenge_runner_github_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-challenge-teamsoft"
      + secret_name     = "RUNNER_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # module.git.github_actions_secret.devops_challenge_thandi_cidr_ipv4 will be created
  + resource "github_actions_secret" "devops_challenge_thandi_cidr_ipv4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "devops-challenge-teamsoft"
      + secret_name     = "THANDI_CIDR_IPV4"
      + updated_at      = (known after apply)
    }

  # module.git.github_branch_protection.devops_challenge will be created
  + resource "github_branch_protection" "devops_challenge" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "devops-challenge-teamsoft"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }
    }

  # module.git.github_repository.devops_challenge will be updated in-place
  ~ resource "github_repository" "devops_challenge" {
      ~ delete_branch_on_merge      = false -> true
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
        id                          = "devops-challenge-teamsoft"
        name                        = "devops-challenge-teamsoft"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.s3.aws_s3_bucket_versioning.server_terraform_bucket will be created
  + resource "aws_s3_bucket_versioning" "server_terraform_bucket" {
      + bucket = "devops-challenge-teamsoft-terraform-bucket"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 7 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pusher: @thandioque, Action: pull_request, Working Directory: terraform, Workflow: Terraform Plan*